[M_Aster_PlotMission03 MissionDefinition]
MissionDescription="Upon learning that the Handsome Sorcerer kidnapped Flamerock's queen, Roland the White Knight suggested you fight your way through the [place]Mines of Avarice[-place], which hold a shortcut to the Handsome Sorcerer's tower and, hopefully, the queen."
TurnInDescription="Though the Vault Hunters ended up inadvertently killing most of their intended allies, the [place]Mines of Avarice[-place] nonetheless proved fruitful. After a bit of violence and some crass humor, they found themselves closer than ever to the Handsome Sorcerer's tower and the queen trapped inside it."

[M_Aster_PlotMission03:FindMineExitSet1 MissionObjectiveSetDefinition]
MissionDescriptionOverride="Upon learning that the Handsome Sorcerer kidnapped Flamerock's queen, Roland the White Knight suggested you fight your way through the [place]Mines of Avarice[-place], which hold a shortcut to the Handsome Sorcerer's tower and, hopefully, the queen.<br><br>With all of the dwarves furious at you (for good reason -- you did murder their leader, after all), you'd best look for a way out of the mines."

[M_Aster_PlotMission03:FindTheDwarfLeaderSet1 MissionObjectiveSetDefinition]
MissionDescriptionOverride="Upon learning that the Handsome Sorcerer kidnapped Flamerock's queen, Roland the White Knight suggested you fight your way through the [place]Mines of Avarice[-place], which hold a shortcut to the Handsome Sorcerer's tower and, hopefully, the queen.<br><br>As the Handsome Sorcerer enslaved the dwarves long ago, they have just as much reason to want him dead as you do. Tina has suggested that you ally with the dwarves against the Handsome Sorcerer."

[M_Aster_PlotMission03:GetLettersSet1 MissionObjectiveSetDefinition]
MissionDescriptionOverride="Upon learning that the Handsome Sorcerer kidnapped Flamerock's queen, Roland the White Knight suggested you fight your way through the [place]Mines of Avarice[-place], which hold a shortcut to the Handsome Sorcerer's tower and, hopefully, the queen.<br><br>With all of the dwarves furious at you (for good reason -- you did murder their leader, after all), you'd best look for a way out of the mines. Unfortunately, the only way to get through the shortcut to the Sorcerer's tower is blocked by dwarven door-locking magic.<br><br>The wizard -- a sad little robot known as Claptrap -- has asked you to find four dwarven runes. The runes, once unscrambled and spoken aloud, will open the shortcut and lead you straight to the Sorcerer's tower."

[M_Aster_PlotMission03:OpenDwarvenDoor MissionObjectiveDefinition]
ProgressMessage="Speak ''FART'' and exit"

[M_Aster_PlotMission03:PlaceTheRunesSet1 MissionObjectiveSetDefinition]
MissionSummaryOverride="Speak the dwarven passphrase and head to the Sorcerer's tower."
MissionDescriptionOverride="Upon learning that the Handsome Sorcerer kidnapped Flamerock's queen, Roland the White Knight suggested you fight your way through the [place]Mines of Avarice[-place], which hold a shortcut to the Handsome Sorcerer's tower and, hopefully, the queen.<br><br>With all of the dwarves furious at you (for good reason -- you did murder their leader, after all), you'd best look for a way out of the mines. Unfortunately, the only way to get through the shortcut to the Sorcerer's tower is blocked by dwarven door-locking magic.<br><br>You collected all four of the runes necessary to open the exit. Now, you need only unscramble the runes and speak the passphrase aloud."

[M_Aster_PlotMission03:PunchTheDwarfSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Upon learning that the Handsome Sorcerer kidnapped Flamerock's queen, Roland the White Knight suggested you fight your way through the [place]Mines of Avarice[-place], which hold a shortcut to the Handsome Sorcerer's tower and, hopefully, the queen.<br><br>As the Handsome Sorcerer enslaved the dwarves long ago, they have just as much reason to want him dead as you do. Tina has suggested that you ally with the dwarves against the Handsome Sorcerer.<br><br>...Unfortunately, however, Brick rolled highest and got to choose how to deal with the leader of the dwarves. Brick has decided to punch him."

[M_Aster_PlotMission03:TalkToTheWizardSet1 MissionObjectiveSetDefinition]
MissionDescriptionOverride="Upon learning that the Handsome Sorcerer kidnapped Flamerock's queen, Roland the White Knight suggested you fight your way through the [place]Mines of Avarice[-place], which hold a shortcut to the Handsome Sorcerer's tower and, hopefully, the queen.<br><br>With all of the dwarves furious at you (for good reason -- you did murder their leader, after all), you'd best look for a way out of the mines.<br><br>You saw a wizard in the distance. Maybe he'll know a way out!"
